VPro/src/ExchangePlans/MobileApplications/MobileApplications.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="45b8ca55-cf30-4d59-8e0c-ff394374dfce">
  <name>MobileApplications</name>
  <attributes>
    <name>Profile</name>
    <type>
      <types>EnumRef.MobileApplicationProfiles</types>
    </type>
  </attributes>
  <attributes>
    <name>MobileAppVersion</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ByResponsible</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SubscriberID</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxСalendar</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DateLastSync</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>AccessIsDenied</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RetailPoint</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>CashRegister</name>
    <type>
      <types>CatalogRef.CashRegisters</types>
    </type>
  </attributes>
  <attributes>
    <name>ForAllCashRegisters</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Roles</name>
    <attributes>
      <name>Role</name>
      <type>
        <types>EnumRef.RolesOfMobileApplication</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

VPro/src/Enums/RolesOfMobileApplication/RolesOfMobileApplication.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>RolesOfMobileApplication</name>
  <enumValues>
    <name>BasicRights</name>
  </enumValues>
  <enumValues>
    <name>MovementMoneyViewAndEdit</name>
  </enumValues>
  <enumValues>
    <name>MovementMoneyOnlyView</name>
  </enumValues>
  <enumValues>
    <name>GoodsMovementsViewAndEdit</name>
  </enumValues>
  <enumValues>
    <name>GoodsMovementsOnlyView</name>
  </enumValues>
  <enumValues>
    <name>OrdersViewAndEdit</name>
  </enumValues>
  <enumValues>
    <name>OrdersOnlyView</name>
  </enumValues>
  <enumValues>
    <name>CounterpartiesViewAndEdit</name>
  </enumValues>
  <enumValues>
    <name>CounterpartiesOnlyView</name>
  </enumValues>
  <enumValues>
    <name>TaxCalendar</name>
  </enumValues>
  <enumValues>
    <name>NomenclatureViewAndEdit</name>
  </enumValues>
  <enumValues>
    <name>NomenclatureOnlyView</name>
  </enumValues>
  <enumValues>
    <name>MoneyMovementReportView</name>
  </enumValues>
  <enumValues>
    <name>ReportDebtsView</name>
  </enumValues>
  <enumValues>
    <name>ReportStockBalancesView</name>
  </enumValues>
  <enumValues>
    <name>ReportSalesView</name>
  </enumValues>
  <enumValues>
    <name>FullRights</name>
  </enumValues>
  <enumValues>
    <name>ProductionViewAndEdit</name>
  </enumValues>
  <enumValues>
    <name>ProductionOnlyView</name>
  </enumValues>
  <enumValues>
    <name>ReadingBalancesOfBilling</name>
  </enumValues>
  <enumValues>
    <name>ReadingBalanceGoods</name>
  </enumValues>
  <enumValues>
    <name>RetailViewAndEdit</name>
  </enumValues>
  <enumValues>
    <name>RetailOnlyView</name>
  </enumValues>
  <enumValues>
    <name>CompanyInfoViewAndEdit</name>
  </enumValues>
  <enumValues>
    <name>CompanyInfoOnlyView</name>
  </enumValues>
</mdclass:Enum>

VPro/src/Enums/MobileApplicationProfiles/MobileApplicationProfiles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>MobileApplicationProfiles</name>
  <enumValues>
    <name>Owner</name>
  </enumValues>
  <enumValues>
    <name>SalesRepresentative</name>
  </enumValues>
  <enumValues>
    <name>ServiceEngineer</name>
  </enumValues>
  <enumValues>
    <name>Seller</name>
  </enumValues>
  <enumValues>
    <name>RetailPoint</name>
  </enumValues>
  <enumValues>
    <name>DetailedSetting</name>
  </enumValues>
  <enumValues>
    <name>MobileTelephony</name>
  </enumValues>
</mdclass:Enum>

VPro/src/ExchangePlans/MobileApplications/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

Procedure BeforeWrite(Cancel)
	
	If Roles.Find(Enums.RolesOfMobileApplication.FullRights, "Role") <> Undefined Then
		Roles.Clear();
		AppendRoleInTable(Enums.RolesOfMobileApplication.BasicRights);
		AppendRoleInTable(Enums.RolesOfMobileApplication.MovementMoneyViewAndEdit);
		AppendRoleInTable(Enums.RolesOfMobileApplication.GoodsMovementsViewAndEdit);
		AppendRoleInTable(Enums.RolesOfMobileApplication.ProductionViewAndEdit);
		AppendRoleInTable(Enums.RolesOfMobileApplication.OrdersViewAndEdit);
		AppendRoleInTable(Enums.RolesOfMobileApplication.CounterpartiesViewAndEdit);
		AppendRoleInTable(Enums.RolesOfMobileApplication.NomenclatureViewAndEdit);
		AppendRoleInTable(Enums.RolesOfMobileApplication.MoneyMovementReportView);
		AppendRoleInTable(Enums.RolesOfMobileApplication.ReportStockBalancesView);
		AppendRoleInTable(Enums.RolesOfMobileApplication.ReportDebtsView);
		AppendRoleInTable(Enums.RolesOfMobileApplication.ReportSalesView);
		AppendRoleInTable(Enums.RolesOfMobileApplication.ReadingBalancesOfBilling);
		AppendRoleInTable(Enums.RolesOfMobileApplication.ReadingBalanceGoods);
		AppendRoleInTable(Enums.RolesOfMobileApplication.RetailViewAndEdit);
		AppendRoleInTable(Enums.RolesOfMobileApplication.CompanyInfoViewAndEdit);
	EndIf;
	
EndProcedure

Procedure AppendRoleInTable(Role) Export
	
	NewRow = Roles.Add();
	NewRow.Role = Role;
	
EndProcedure

Procedure SetRolesByProfile(ProfileForSetup) Export
	
	Profile = ProfileForSetup;
	
	Roles.Clear();
	AppendRoleInTable(Enums.RolesOfMobileApplication.BasicRights);
	
	If ProfileForSetup = Enums.MobileApplicationProfiles.Owner Then
		AppendRoleInTable(Enums.RolesOfMobileApplication.CounterpartiesViewAndEdit);
		AppendRoleInTable(Enums.RolesOfMobileApplication.NomenclatureViewAndEdit);
		AppendRoleInTable(Enums.RolesOfMobileApplication.OrdersViewAndEdit);
		AppendRoleInTable(Enums.RolesOfMobileApplication.MovementMoneyViewAndEdit);
		AppendRoleInTable(Enums.RolesOfMobileApplication.GoodsMovementsViewAndEdit);
		AppendRoleInTable(Enums.RolesOfMobileApplication.ProductionViewAndEdit);
		AppendRoleInTable(Enums.RolesOfMobileApplication.MoneyMovementReportView);
		AppendRoleInTable(Enums.RolesOfMobileApplication.ReportStockBalancesView);
		AppendRoleInTable(Enums.RolesOfMobileApplication.ReportSalesView);
		AppendRoleInTable(Enums.RolesOfMobileApplication.ReportDebtsView);
		AppendRoleInTable(Enums.RolesOfMobileApplication.RetailViewAndEdit);
		AppendRoleInTable(Enums.RolesOfMobileApplication.CompanyInfoViewAndEdit);
	ElsIf ProfileForSetup = Enums.MobileApplicationProfiles.Seller Then
		AppendRoleInTable(Enums.RolesOfMobileApplication.CounterpartiesViewAndEdit);
		AppendRoleInTable(Enums.RolesOfMobileApplication.NomenclatureOnlyView);
		AppendRoleInTable(Enums.RolesOfMobileApplication.OrdersViewAndEdit);
		AppendRoleInTable(Enums.RolesOfMobileApplication.MovementMoneyViewAndEdit);
		AppendRoleInTable(Enums.RolesOfMobileApplication.GoodsMovementsViewAndEdit);
		AppendRoleInTable(Enums.RolesOfMobileApplication.MoneyMovementReportView);
		AppendRoleInTable(Enums.RolesOfMobileApplication.ReportStockBalancesView);
		AppendRoleInTable(Enums.RolesOfMobileApplication.ReportSalesView);
		AppendRoleInTable(Enums.RolesOfMobileApplication.CompanyInfoOnlyView);
	ElsIf ProfileForSetup = Enums.MobileApplicationProfiles.SalesRepresentative Then
		AppendRoleInTable(Enums.RolesOfMobileApplication.CounterpartiesViewAndEdit);
		AppendRoleInTable(Enums.RolesOfMobileApplication.NomenclatureOnlyView);
		AppendRoleInTable(Enums.RolesOfMobileApplication.OrdersViewAndEdit);
		AppendRoleInTable(Enums.RolesOfMobileApplication.MovementMoneyViewAndEdit);
		AppendRoleInTable(Enums.RolesOfMobileApplication.GoodsMovementsViewAndEdit);
		AppendRoleInTable(Enums.RolesOfMobileApplication.MoneyMovementReportView);
		AppendRoleInTable(Enums.RolesOfMobileApplication.ReportStockBalancesView);
		AppendRoleInTable(Enums.RolesOfMobileApplication.ReportDebtsView);
		AppendRoleInTable(Enums.RolesOfMobileApplication.CompanyInfoOnlyView);
	ElsIf ProfileForSetup = Enums.MobileApplicationProfiles.ServiceEngineer Then
		AppendRoleInTable(Enums.RolesOfMobileApplication.CounterpartiesOnlyView);
		AppendRoleInTable(Enums.RolesOfMobileApplication.NomenclatureOnlyView);
		AppendRoleInTable(Enums.RolesOfMobileApplication.OrdersViewAndEdit);
		AppendRoleInTable(Enums.RolesOfMobileApplication.MovementMoneyViewAndEdit);
		AppendRoleInTable(Enums.RolesOfMobileApplication.GoodsMovementsViewAndEdit);
		AppendRoleInTable(Enums.RolesOfMobileApplication.MoneyMovementReportView);
		AppendRoleInTable(Enums.RolesOfMobileApplication.ReportStockBalancesView);
		AppendRoleInTable(Enums.RolesOfMobileApplication.CompanyInfoOnlyView);
	ElsIf ProfileForSetup = Enums.MobileApplicationProfiles.RetailPoint Then
		AppendRoleInTable(Enums.RolesOfMobileApplication.NomenclatureOnlyView);
		AppendRoleInTable(Enums.RolesOfMobileApplication.ReportSalesView);
		AppendRoleInTable(Enums.RolesOfMobileApplication.RetailViewAndEdit);
		AppendRoleInTable(Enums.RolesOfMobileApplication.CompanyInfoOnlyView);
	ElsIf ProfileForSetup = Enums.MobileApplicationProfiles.MobileTelephony Then
		AppendRoleInTable(Enums.RolesOfMobileApplication.CounterpartiesOnlyView);
	EndIf;
	
EndProcedure

#EndIf
